# LowestAssociatedLevel Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LowestAssociatedLevel Property
ParameterTypeId Class See Also
---
"Lowest Associated Level": The lowest level associated with this Analytical Element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LowestAssociatedLevel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LowestAssociatedLevel As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LowestAssociatedLevel {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace